Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོས། བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་མང་པོ་དགེ་སློང་སྟོང་དང་ཐབས་ཅིག་ཏུ་ཡུལ་མ་ག་དྷཱར་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་ཏེ། ཡུལ་མ་ག་དྷཱ་པ་རྣམས་ཀྱི་མཆོད་རྟེན་རབ་བརྟན་ཞེས་བྱ་བ་ན། སྨྱིག་མའི་ནགས་ཁྲོད་དུ་བྱོན་ཏོ་ཞེས་ཐོས་སོ། །
en: Bimbisāra, the king of Magadha, heard that the Blessed One and a saṅgha of numerous monks including the thousand monks had made their way across the country to arrive at the Magadha stūpa called Very Steady, near Forest of Reeds.

source: ཐོས་ནས་ཀྱང་རྒྱལ་པོའི་འབྱོར་པ་ཆེན་པོ་དང་། རྒྱལ་པོའི་མཐུ་ཆེན་པོ་དང་།
en: Upon hearing this, he emerged from Rājagṛha in a display of great opulence and royal power,

source: ཤིང་རྟ་ཁྲི་ཉིས་སྟོང་དང་། རྒོད་མ་སྟོང་བརྒྱད་བརྒྱ་དང་། ཡུལ་མ་ག་དྷཱ་ན་གནས་པའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་སྟོང་ཕྲག་དུ་མ་དག་དང་ཐབས་ཅིག་ཏུ་རྒྱལ་པོའི་ཁབ་ནས་བྱུང་སྟེབཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་སོང་བ་ལས། གྲོང་ཁྱེར་གྱི་སྒོར་བྱུང་བ་ན་དེའི་མགོ་བོ་ལས་ཅོད་པན་ལྷུང་ནས
en: with two thousand chariots and 1,800 mares, accompanied by thousands upon thousands of brahmins and householders who lived in Magadha. As he was coming out of the city gates to go before the Blessed One, see him, and venerate him, the crown fell off his head,

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ་བདག་གིས་བཅོམ་ལྡན་འདས་བལྟ་བ་མ་ལེགས་པ་ཞིག་ཏུ་མི་འགྱུར་གྲང་སྙམ་མོ། །
en: and the thought occurred to him, “Perhaps this bodes ill for my visit to the Blessed One?”

source: དེ་ནས་ལྷ་རྣམས་ཀྱིས་སྦྲན་པ། འདི་ནི་ལེགས་པར་འགྱུར་ཏེ།
en: The gods called out to him, “Good shall come of this!

source: ཁྱོད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བྱ་བ་ནི་ལེགས་པར་འགྱུར་བ་ཡིན་ནོ། །
en: Good shall come of you seeing the Blessed One and venerating him.

source: དེ་ལྟ་མོད་ཀྱིས་ཁྱོད་གང་དག་དང་དགེ་བའི་རྩ་བ་བསྐྲུན་པ་དེ་དག་ཁ་ཅིག་ནི་ཁྲི་མོན་དུ་བཅུག་ཅིང་འདུག །
en: However, some of the people you have imprisoned have produced roots of virtue.

source: ཁ་ཅིག་ནི་ཡུལ་དག་ན་འདུག་གི །རྒྱལ་པོ་ཁྱོད་ཀྱིས་བཙོན་རྣམས་གཏང་བའི་རིགས་སོ། །
en: It would be right for you to release these prisoners who yet remain in your country, king,

source: ལྗོངས་དག་ཏུ་ཡང་དྲིལ་བསྒྲགས་ཏེ། དེ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་དེང་ཤིག་ཅེས་བྱས་སོ། །
en: and proclaim throughout the country that they too should come along to see the Blessed One and venerate him.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོས་བཙོན་རྣམས་བཏང་ནས། ཡུལ་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་ཐམས་ཅད་བསྡུས་ཏེ།
en: No sooner had King Bimbisāra heard this than he released the prisoners, calling together all the many people who lived in his country.

source: སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་ཡུལ་མ་ག་དྷཱ་པ་རྣམས་ཀྱི་མཆོད་རྟེན་རབ་བརྟན་ཞེས་བྱ་བ་ན།
en: As he was traveling in the company of this great crowd of people all the way to the Magadha stūpa called Very Steady,

source: སྨྱིག་མའི་ནགས་ཁྲོད་ཀྱི་རྒྱུད་ཐོག་ཐག་ཏུ་སོང་ནས།
en: near Forest of Reeds, he looked back at his assembled army.

source: དེས་རང་གི་དཔུང་གི་ཚོགས་རྣམས་ལ་ཕྱིར་བལྟས་ཏེ། དེས་དམག་ཚོགས་ཆེན་པོ་མཐོང་ནས་རྒྱགས་པ་སྐྱེས་ཏེ།
en: When he saw his entire army assembled he became arrogant and thought,

source: བྱད་གཟུགས་དང་མཐུ་དབང་ང་དང་མཚུངས་པ་མེད་དོ་སྙམ་མོ། །
en: “No one can equal me in appearance and might.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའི་སེམས་ཐུགས་ཀྱིས་མཁྱེན་ནས་དེ་བས་ཀྱང་ཆེས་བལྟ་ན་
en: The Blessed One directly apprehended what King Bimbisāra was thinking,

source: སྡུག་པ་དང་། ཆེས་བྱད་གཟུགས་བཟང་པོའི་རྒྱལ་པོ་ལྔ་བརྒྱ་མངོན་པར་སྤྲུལ་ནསདེ་དག་ལ་ཆོས་སྟོན་ཅིང་བཞུགས་སོ། །
en: so he emanated five hundred kings, gorgeous and statuesque, to whom he began teaching the Dharma.

source: དེ་ནས་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ནས།
en: King Bimbisāra of Magadha approached the Blessed One.

source: དེ་ཇི་སྲིད་བཞོན་པས་འགྲོ་བར་བྱ་བའི་ས་དེ་སྲིད་དུ་བཞོན་པ་ལ་ཞོན་ཏེ་སོང་ནས། རྒྱལ་ཐབས་རྣམ་པ་ལྔ་སྟེ། གཙུག་ཏོར་དང་། གདུགས་དང་། རལ་གྲི་དང་། ནོར་བུ་དང་། རྔ་ཡབ་རྣམས་དང་། ལྷམ་ཁྲ་བོ་རྣམས་བཞག་ནས།
en: The king went as far as he could go by vehicle and then left behind the five signs of his consecration—crown, parasol, sword, jewel, and tail fan—as well as his colorful boots,

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ།
en: and approached the Blessed One.

source: རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ན། རྒྱལ་པོ་ཆེས་གཟུགས་བཟང་ཞིང་ཆེས་མཛེས་པ་ལྔ་བརྒྱ་ཆོས་ཉན་ཅིང་
en: There he saw the five hundred kings, gorgeous and statuesque, sitting before the Blessed One listening to the Dharma.

source: འཁོད་པ་མཐོང་ནས་དེའི་བྱད་གཟུགས་ཀྱིས་རྒྱགས་པ་གང་ཡིན་པ་དེ་མེད་པར་གྱུར་ཏོ། །
en: When he saw them, all his arrogance about his appearance vanished,

source: དེ་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: and he thought,

source: གལ་ཏེ་བདག་གིས་བདག་གི་མིང་དང་རུས་ནས་མ་སྨོས་ན། བདག་བཅོམ་ལྡན་འདས་ཀྱིས་མི་དགོངས་སོ་སྙམ་ནས།
en: “If I do not state my name and my lineage, the Blessed One will take no interest in me.”

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ།
en: drew down the right shoulder of his upper garment,

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས།
en: knelt down on his right knee,

source: རང་གི་མིང་རུས་ལན་གསུམ་གྱི་བར་དུ་སྨོས་ཏེ།
en: and three times stated his name and lineage.

source: བཙུན་པ་བདག་ནི་ཡུལ་མ་ག་དྷཱའི་བདག་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ་ལགས་སོ། །
en: “Lord, I am King Bimbisāra of Magadha.

source: བཙུན་པ་བདག་ནི་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ་ལགས་སོ་ཞེས་བྱས་སོ། །
en: Lord, I am King Bimbisāra of Magadha . . . .”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Thereupon the Blessed One spoke, saying,

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ནི་དེ་ཡིན་ཏེ།
en: “So it is, Great King.

source: ཁྱོད་ནི་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ་ཡིན་ནོ། །
en: You are King Bimbisāra of Magadha.

source: རྒྱལ་པོ་ཆེན་པོ་རང་གི་སྟན་གང་ཡིན་པ་ལ་འདུག་ཅིག །
en: Please take your seat, Great King.”

source: དེ་ནས་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Then King Bimbisāra of Magadha touched his head to the Blessed One’s feet and took a seat at one side.

source: ཡུལ་མ་ག་དྷཱའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་ཁ་ཅིག་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: Some of the brahmins and householders of Magadha also touched their heads to the Blessed One’s feet

source: ཁ་ཅིག་ནི་བཅོམ་ལྡན་འདས་དང་མངོན་སུམ་དུ་ཡང་དག་པར་དགའ་བར་འགྱུར་བ་དང་། ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་གཏམ་རྣམ་པ་སྣ་ཚོགས་བྱས་ནས།
en: Some made all manner of entertaining and jovial conversation with the Blessed One

source: ཁ་ཅིག་ནི་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Some bowed toward the Blessed One with palms pressed together and took seats to one side.

source: ཁ་ཅིག་ནི་ཐག་རིང་པོ་ཞིག་ནས། བཅོམ་ལྡན་འདས་མཐོང་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Some saw the Blessed Buddha from a distance, and upon seeing the Blessed One, took seats to one side.

source: དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་རལ་པ་ཅན་ཡང་འཁོར་དེ་ཉིད་དུ་འདུས་ཏེ་འདུག་གོ། །
en: At that time the dreadlocked ascetic Venerable Uruvilvā Kāśyapa was also seated among the company.

source: དེ་ནས་ཡུལ་མ་ག་དྷཱའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The brahmins and householders of Magadha thought,

source: ཅི་དགེ་སྦྱོང་ཆེན་པོ་དེ་འོད་སྲུང་གི་ཐད་ན་ཚངས་པར་སྤྱད་པ་སྤྱོད་དམ།
en: “Does the Great Ascetic practice Kāśyapa ’s code of conduct,

source: འོན་ཏེ་ལྟེང་རྒྱས་འོད་སྲུང་རལ་པ་ཅན་དགེ་སྦྱོང་ཆེན་པོའི་ཐད་ན་ཚངས་པར་སྤྱད་པ་སྤྱོད་ཞིག་གུ་སྙམ་མོ། །
en: or does the dreadlocked ascetic Venerable Uruvilvā Kāśyapa practice the Great Ascetic’s code of conduct?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡུལ་མ་ག་དྷཱའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་རྣམས་ཀྱི་སེམས་ཐུགས་ཀྱིས་མཁྱེན་ནས།
en: The Blessed One directly apprehended what the brahmins and householders of Magadha were thinking,

source: ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: and he addressed Venerable Kāśyapa in verse:

source: ལྟེང་རྒྱས་གནས་པ་ཁྱོད་ཀྱིས་ཅི་མཐོང་ན། །
en: “Inhabitant of Uruvilvā, what do you see?

source: འདིར་ནི་མེ་སྤངས་དྲང་སྲོང་བརྟུལ་ཞུགས་སྤངས། །
en: Here there is no fire, sage, or observance.

source: འོད་སྲུང་ཁྱོད་ཀྱིས་སྦྱིན་སྲེག་ཅིའི་ཕྱིར་སྤངས། །
en: Kāśyapa , why have you given up the fire sacrifice?

source: དོན་དེ་ང་ལ་ཀུན་ནས་བརྗོད་པར་གྱིས། །
en: Please, tell me all the reasons why.”

source: འདི་ན་ཁ་ཅིག་ཟས་དང་བཏུང་བ་རྣམས། །
en: “Some here praise food and drink,

source: ཁུ་བཅུད་འཁོར་དང་བུད་མེད་བསྔགས་པར་བགྱིད། །
en: Others retinue, or women.

source: དེ་རྣམས་ཕུང་པོའི་དྲི་མ་མཐོང་བས་ན། །
en: Since I’ve seen the impurity of these heaps,

source: བདག་ནི་མཆོད་སྦྱིན་མེ་ལ་དགའ་མ་མཆིས། །
en: I find no joy in the sacrificial fire.”

source: ཁྱོད་ནི་འདོད་པ་རྣམས་ལ་མི་དགའ་ཞིང་། །ཟས་སྐོམ་སྟན་རྣམས་ལ་ཡང་མི་དགའ་ན། །ཁྱོད་ནི་ཇི་ལྟར་ལྷ་མིའི་འཇིག་རྟེན་ན། །ཡིད་དགའ་འོད་སྲུང་དྲིས་པའི་ལན་ཐོབ་ཤིག །
en: “If you’ve no taste for lusting, nor for food, Nor for drink, nor for a high, haughty seat, How is it that you—among all on earth— Could be happy, Kāśyapa ? Answer this question for me.”

source: ཕུང་པོ་མེད་པ་ཞི་བཅོམ་ཅི་ཡང་མེད། །
en: “There is no greater peace than being free of heaps,

source: འདོད་དང་སྲིད་ལ་མ་ཆགས་གཞན་མི་འགྱུར། །
en: Nothing like non-attachment to sense pleasures and existence.

source: གཞན་གྱིས་དཀྲིར་མེད་གོ་འཕང་མཐོང་བས་ན། །
en: Having seen the state that another cannot induce,

source: མཆོད་སྦྱིན་རྣམས་དང་བརྟུལ་ཞུགས་མེ་རྣམས་ཀྱིས། །གྲོལ་བར་འགྱུར་སྙམ་བདག་གི་ཡིད་ཀྱང་རྨོངས། །
en: “My deluded mind thought I’d be liberated By sacrifices and fire observances.

source: འཆི་འཕོ་མ་མཆིས་གནས་མཆོག་མ་མཐོང་བས། །སྐྱེ་འཆིའི་རྗེས་འབྲང་བདག་ནི་ལོང་བར་གྱུར། །
en: Since I hadn’t seen the supreme state free of death, Birth followed death and I remained blind.

source: མི་མཆོག་སྐྱོབ་པས་ལེགས་གསུངས་འདུས་མ་བྱས། །གོ་འཕང་དེ་ནི་བདག་གིས་ད་མཐོང་ངོ་། །
en: “Now I’ve seen the uncompounded state The best of humans and protector taught so well.

source: ཐུབ་པ་རྣམ་འདྲེན་གཽ་ཏམ་བདེན་པའི་རྩལ། །ཁྱོད་ནི་སྐྱེ་བོ་མང་ཕྱིར་བྱུང་བ་ལགས། །
en: You, Gautama—foremost of sages, well versed in truth— Truly were born to benefit many beings.”

source: རབ་ཏུ་རྣམ་པར་ཕྱེ་བའི་ཆོས་རྣམས་ལ། །གནས་ཀྱིས་གཤེགས་སུ་བབ་པ་གང་ཡིན་པ། དེ་ནི་ཁྱོད་ཀྱིས་ལེགས་པར་བསམས་པ་ཡིན། །
en: “You have reflected well upon What strikes to the vital point As you dwelt upon phenomena, so finely distinguished—

source: ཁྱོད་ཀྱིས་གཏན་ལ་ཕེབས་པས་ལེགས་པར་འོངས། །
en: You are welcome to resolve it once and for all.

source: འོད་སྲུང་འཁོར་རྣམས་སྐྱོ་བ་རབ་བསྐྱེད་ཅིག །
en: “O Kāśyapa , may you fill those in your retinue with sorrow for saṃsāra!”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་རལ་པ་ཅན་གྱིས་ཇི་ལྟར་སེམས་མཉམ་པར་བཞག་པ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: Then, just as the dreadlocked ascetic Venerable Uruvilvā Kāśyapa placed his mind in equipoise and entered into meditative stabilization ,

source: ཤར་ཕྱོགས་ཀྱི་སྟེང་གི་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ནས། སྤྱོད་ལམ་རྣམ་པ་བཞི་བྱེད་དེ།
en: rising up into the eastern sky, he began to carry out the four activities—

source: འཆག་པ་དང་། སྡོད་པ་དང་། འདུག་པ་དང་། ཉལ་བར་བྱེད་དོ། །
en: walking, sitting, standing, and sleeping—

source: མེའི་ཁམས་ལ་སྙོམས་པར་འཇུག་པར་བྱེད་དེ།
en: and entered into equipoise on the element of fire.

source: ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་རལ་པ་ཅན་མེའི་ཁམས་ལ་སྙོམས་པར་ཞུགས་པའི་ལུས་ལས་འོད་ཟེར་རྣམ་པ་སྣ་ཚོགས་བྱུང་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་གྱི་ཁ་དོག་ལྟ་བུ་རྣམས་བྱུང་ངོ་། །
en: Now in equipoise on the element of fire, from his body the dreadlocked ascetic Venerable Uruvilvā Kāśyapa emitted rays of light in various hues such as blue, gold, red, white, rose madder, and crystalline,

source: ཆོ་འཕྲུལ་ཟུང་དུ་ཡང་སྟོན་པར་བྱེད་དོ། །
en: then made a further display of miracles:

source: ལུས་ཀྱི་སྟོད་ནས་ནི་མེ་འབར་ལ།
en: fire blazed from his upper body while

source: ལུས་ཀྱི་སྨད་ནས་ནི་ཆུ་གྲང་མོའི་རྒྱུན་འབབ་བོ། །
en: a stream of cool water flowed from his lower body;

source: ལུས་ཀྱི་སྨད་ནས་ནི་མེ་འབར་ལ།
en: then fire blazed and from his lower body while

source: ལུས་ཀྱི་སྟོད་ནས་ནི་ཆུ་གྲང་མོའི་རྒྱུན་འབབ་བོ། །
en: a stream of cool water flowed from his upper body.

source: ཤར་ཕྱོགས་སུ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་སུ་ཡང་དེ་དང་འདྲ་བར་བྱས་སོ། །
en: He then performed the same miracles in the south, the west, and the north that he performed in the east.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་རལ་པ་ཅན་གྱིས་ཕྱོགས་བཞིར་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་རྣམ་པ་བཞི་བཞི་བསྟན་ནས། རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱེད་པ་བསྡུས་ཏེ།
en: Having displayed miracles in each of the four cardinal directions the dreadlocked ascetic Venerable Uruvilvā Kāśyapa concluded his miraculous display,

source: བཅོམ་ལྡན་འདས་ནི་བདག་གི་སྟོན་པ་ལགས་སོ། །
en: “Blessed One, you are my teacher.

source: བདེ་བར་གཤེགས་པ་ནི་བདག་གི་སྟོན་པ་ལགས་སོ། །
en: The Sugata is my teacher.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འོད་སྲུང་དེ་ནི་དེ་ཡིན་ནོ། །
en: “ Kāśyapa , so it is,” the Blessed One replied.

source: དེ་ནི་དེ་ཡིན་ཏེ།
en: “It is just as you say, Kāśyapa .

source: འོད་སྲུང་ཁྱོད་ཀྱི་སྟོན་པ་ནི་ང་ཡིན་ནོ། །
en: I am your teacher, Kāśyapa .

source: འོད་སྲུང་ཁྱོད་རང་གི་སྟན་ཇི་ལྟ་བ་བཞིན་དུ་འདུག་ཅིག །
en: Kāśyapa , take your place on your designated seat, just as it should be.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་རལ་པ་ཅན་རང་གི་སྟན་ཇི་ལྟ་བ་བཞིན་དུ་འདུག་གོ། །
en: The dreadlocked ascetic Venerable Uruvilvā Kāśyapa took his place on his designated seat, just as it should be,

source: ལྟེང་རྒྱས་འོད་སྲུང་རལ་པ་ཅན་དེ་དགེ་སྦྱོང་ཆེན་པོ་གཽ་ཏ་མའི་ཐད་ན་ཚངས་པར་སྤྱད་པ་སྤྱོད་པ་ཡིན་གྱིས།
en: “The dreadlocked ascetic Venerable Uruvilvā Kāśyapa practices the ascetic Gautama’s code of conduct.

source: དགེ་སྦྱོང་ཆེན་པོ་ལྟེང་རྒྱས་འོད་སྲུང་གི་ཐད་ན་ཚངས་པར་སྤྱད་པ་སྤྱོད་པ་ནི་མ་ཡིན་ནོ་སྙམ་མོ། །
en: It is certain, then, that the Great Ascetic does not practice Uruvilvā Kāśyapa ’s code of conduct.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ་ལ་བཀའ་སྩལ་པ།
en: Thereupon the Blessed One addressed King Bimbisāra of Magadha:

source: རྒྱལ་པོ་ཆེན་པོ་གཟུགས་ནི་སྐྱེ་ཡང་སྐྱེ་ལ་འགྲིབ་ཀྱང་འགྲིབ་སྟེ། དེའི་སྐྱེ་བ་ཡང་རིག་པར་བྱ་དགོས་ལ། འགྲིབ་པ་ཡང་རིག་པར་བྱ་དགོས་སོ། །
en: “Great King, forms arise and decay, one after another. You should know the arising of forms, and you should know their decay.

source: རྒྱལ་པོ་ཆེན་པོ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡང་སྐྱེ་ཡང་སྐྱེ་ལ། འགྲིབ་ཀྱང་འགྲིབ་སྟེ།
en: Great King, sensations, perceptions, formations, and consciousness likewise arise and decay, one after another.

source: དེའི་སྐྱེ་བ་ཡང་རིག་པར་བྱ་དགོས་ལ། འགྲིབ་པ་ཡང་རིག་པར་བྱ་དགོས་སོ། །
en: You should know their arising, and you should know their decay.

source: རྒྱལ་པོ་ཆེན་པོ་གཟུགས་སྐྱེ་བ་དང་། འགྲིབ་པའི་ཆོས་ཅན་ཡིན་པར་རིག་ནས།
en: Great King, knowing the nature of forms’ arising and decay,

source: གཟུགས་དེ་ཡོངས་སུ་ཤེས་སོ། །
en: you will understand form.

source: རྒྱལ་པོ་ཆེན་པོ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡང་སྐྱེ་བ་དང་། འགྲིབ་པའི་ཆོས་ཅན་ཡིན་པར་རིག་ནས།
en: Great King, knowing also the nature of the arising and decay of sensations, perceptions, formations, and consciousness,

source: རྣམ་པར་ཤེས་པ་དེ་ཡོངས་སུ་ཤེས་སོ། །
en: you will understand consciousness.

source: རྒྱལ་པོ་ཆེན་པོ་གཟུགས་ཡོངས་སུ་ཤེས་ན། གཟུགས་དེ་ལ་བདག་གི་བདག་ཡིན་ནོ་སྙམ་དུ་འཛིན་པར་མི་བྱེད།
en: “Great King, when you understand form, you do not grasp at it, thinking, ‘This is my self!’

source: ལེན་པར་མི་བྱེད། གནས་པར་མི་བྱེད། མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: Nor do you appropriate it, dwell upon it, or continue your habitual adherence to it.

source: རྒྱལ་པོ་ཆེན་པོ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་ཤེས་ན། རྣམ་པར་ཤེས་པ་དེ་ལ་བདག་གི་བདག་ཡིན་ནོ་སྙམ་དུ་འཛིན་པར་མི་བྱེད།
en: Great King, when you understand sensations, perceptions, formations, and consciousness, you do not grasp at consciousness, thinking, ‘This is my self!’

source: རྒྱལ་པོ་ཆེན་པོ་གཟུགས་ལ་མི་འཛིན། མི་ལེན་མི་གནས། མངོན་པར་ཞེན་པར་མི་བྱེད་ན།
en: “Great King, not grasping at form nor appropriating it, dwelling upon it, or habitually adhering to it—

source: དཔག་ཏུ་མེད་པ། གྲངས་མེད་པ། མྱ་ངན་ལས་འདས་པ་ཞེས་ང་ཟེར་རོ། །
en: this I call ‘the infinite, the boundless, nirvāṇa.’

source: རྒྱལ་པོ་ཆེན་པོ་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་མི་འཛིན། མི་ལེན་མི་གནས། མངོན་པར་ཞེན་པར་མི་བྱེད་ན།
en: Great King, not grasping at sensations, perceptions, formations, and consciousness, nor appropriating them, dwelling upon them, or habitually adhering to them—

source: ཇི་སྟེ་གཟུགས་བདག་མ་ཡིན་ཞིང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་བདག་མ་ཡིན་ན། བདག་གམ་སེམས་ཅན་ནམ། སྲོག་གམ། སྐྱེ་བའམ། གསོ་བའམ། གང་ཟག་གམ། ཤེད་བུའམ། ཤེད་ཅན་ནམ། བྱེད་པའམ། བྱེད་པ་པོའམ། སྨྲ་བ་པོའམ། ཚོར་བ་པོའམ། སྐྱེད་པ་པོའམ། ཀུན་ཏུ་སྐྱེད་པ་པོར་སུ་ཞིག་འགྱུར།
en: “If forms are not the self, and, likewise, sensations, perceptions, formations, and consciousness are not the self, what then is the self, the being, the life force, the creature, the soul, the person, the human being, humankind, the actor, the agent, the speaker, the feeler, the creator, or the fundamental creator?

source: མ་སྐྱེས་ཤིང་། མ་བྱུང་ལ་འབྱུང་བར་མི་འགྱུར་ན་ཡང་ཕུང་པོ་འདི་དག་ནི་འདོར་ལ། ཕུང་པོ་གཞན་ནི་ལེན་པར་མི་འགྱུར་རོ་སྙམ་མོ། །
en: If nothing has been born or arisen, and nothing will arise, then once these aggregates are discarded no other aggregates will be appropriated.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡུལ་མ་ག་དྷཱའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་རྣམས་ཀྱི་སེམས་ཐུགས་ཀྱིས་མཁྱེན་ནས་
en: The Blessed One directly apprehended what the brahmins and householders of Magadha were thinking, then addressed the monks:

source: དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་བདག་བདག་ཅེས་བྱ་བ་ནི། སོ་སོའི་སྐྱེ་བོ་ཐོས་པ་དང་མི་ལྡན་པ་རྣམས་ཀྱིས་སོ་སོར་བཟུང་བར་ཟད་ཀྱི།
en: “Monks, the so-called ‘self’ is only something apprehended by ordinary beings who do not know any better.

source: འདི་ན་བདག་ཀྱང་མེད། བདག་གི་ཡང་མེད་དོ། །
en: But there is in fact no such self or anything possessed there.

source: དགེ་སློང་དག་སྐྱེ་བ་ན། སྡུག་བསྔལ་འདི་ཉིད་སྐྱེ་ལ། འགག་པ་ན་སྡུག་བསྔལ་འདི་ཉིད་འགག་གོ། །
en: “Monks, this suffering is born at birth, and this suffering ceases at cessation.

source: སྐྱེ་བ་ན་འདུ་བྱེད་རྣམས་ཉིད་སྐྱེ་ལ། འགག་པ་ན་འདུ་བྱེད་རྣམས་ཉིད་འགག་གོ། །
en: These formations are born at birth, and these formations cease at cessation.

source: རྒྱུ་དེ་དག་དང་རྐྱེན་དེ་དག་ལ་བརྟེན་ནས། སེམས་ཅན་རྣམས་ཀྱི་འདུ་བྱེད་ཀྱི་རྒྱུད་འཇུག་པར་འགྱུར་རོ། །
en: Consigned to such causes and conditions, beings will be subject to a perpetual stream of formations.

source: དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པས་ནི་སེམས་ཅན་རྣམས་ཀྱི་འདུ་བྱེད་ཀྱི་རྒྱུད་ཀྱི་ཉིང་མཚམས་སྦྱོར་བ་ཐུགས་སུ་ཆུད་ནས། འཆི་འཕོ་དང་། སྐྱེ་བ་འདོགས་པར་མཛད་དོ། །
en: “Monks, the Tathāgata directly apprehends the reincarnation of beings in a perpetual stream of formation, and labels it death, transmigration, and rebirth.

source: ལྷའི་སྤྱན་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པས་སེམས་ཅན་རྣམས་འཆི་འཕོ་ཞིང་འདུག་པ་དང་། སྐྱེ་ཞིང་འདུག་པ་དང་།
en: With perfectly clear divine vision, beyond that of normal humans, the Blessed One sees how beings continue to die and transmigrate, and continue to take birth;

source: ཁ་དོག་བཟང་པོ་དང་། ངན་པ་དང་།
en: whether they will have a good appearance or a bad one;

source: བདེ་འགྲོར་འགྲོ་བ་རྣམས་དང་། ངན་འགྲོར་འགྲོ་བ་རྣམས་དང་།
en: and whether they will take happy births or fall to lower realms.

source: སེམས་ཅན་ལས་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བ་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “I am fully aware of their actions, and I am fully aware of their destinations.

source: ཀྱེ་སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ་དང་། ངག་གིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ་དང་། ཡིད་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ་དང་། འཕགས་པ་རྣམས་ལ་སྐུར་པ་འདེབས་པ་དང་། ལོག་པར་ལྟ་བ་དང་། ལོག་པར་ལྟ་བའི་ལས་དང་། ཆོས་ཡང་དག་པར་བླངས་པའི་ཕྱིར་རྒྱུ་དེ་དང་། རྐྱེན་དེས་ལུས་དང་བྲལ་ཏེཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བའི་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །
en: I see that when they separate from their bodies at death—by cause and condition of the wrong views and actions they adopted—those who comport themselves wrongly, those who speak wrongly, those who reflect wrongly, those who hurl insults at the noble ones, and those who hold wrong views will fall to lower realms and take rebirth as hell beings.

source: ཀྱེ་སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ་དང་། ངག་གིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ་དང་། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ་དང་། འཕགས་པ་རྣམས་ལ་སྐུར་པ་མི་འདེབས་པ་དང་། ཡང་དག་པར་ལྟ་བ་དང་། ཡང་དག་པའི་ལས་དང་། ཆོས་ཡང་དག་པར་བླངས་པའི་ཕྱིར་རྒྱུ་དེ་དང་རྐྱེན་དེས་ལུས་དང་བྲལ་ཏེཤི་བའི་འོག་ཏུ་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་གྱི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ། །
en: And I see that when they separate from their bodies at death—by cause and condition of the right Dharma and actions they adopted—those who comport themselves rightly, those who speak rightly, those who reflect rightly, those who refrain from hurling insults at the noble ones, and those who hold right views will take the highest rebirth among the god realms.

source: དགེ་སློང་དག་ངས་དེ་ལྟར་ཤེས་ཤིང་དེ་ལྟར་མཐོང་བས་ན།
en: “Monks, because I have known it to be so and seen it to be so, I would not say,

source: ང་ནི་འདི་སྐད་དུ། ང་ནི་བདག་དེ་ཡིན་ནོ་ཞེའམ། ང་ནི་སེམས་ཅན་ནམ། སྲོག་གམ། སྐྱེ་བའམ། གསོ་བའམ། གང་ཟག་གམ། ཤེད་བུའམ། ཤེད་ཅན་ནམ། བྱེད་པའམ། བྱེད་པ་པོའམ། སྨྲ་བ་པོའམ། ཚོར་བ་པོའམ། སྐྱེད་པ་པོའམ། ཀུན་དུ་སྐྱེད་པ་པོ་ཡིན་ནོ་ཞེས་མི་ཟེར་རོ། །
en: ‘I am self, I am a being, I am a life force, I am a creature, I am the soul, I am a person, I am a human being, I am part of humankind, I am an actor, I am an agent, I am a speaker, I am a feeler, I am the creator, or I am a fundamental creator.’ These things I would not say.

source: མ་སྐྱེས་ཤིང་མ་བྱུང་ལ་འབྱུང་བར་མི་འགྱུར་ན་ཡང་། ཕུང་པོ་འདི་དག་ནི་འདོར་ལ། ཕུང་པོ་གཞན་ནི་ལེན་པར་མི་འགྱུར་རོ་སྙམ་དུ་མི་འཛིན་ཏོ། །
en: Nor would I grasp at the thought, ‘Although they are not arisen, have never arisen, and will never arise, when these aggregates are discarded no other aggregates will be appropriated.”

source: ཆོས་ཀྱི་བརྡ་ཙམ་ནི་མ་གཏོགས་སོ། །
en: “But this does not include the conventional expression of the Dharma.

source: དེ་ལ་ཆོས་ཀྱི་བརྡ་ནི་འདི་ལྟ་སྟེ།
en: The conventional expression of the Dharma is as follows:

source: འདུ་བྱེད་རྣམས་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ་འབྱུང་།
en: Due to the condition of formations there is consciousness.

source: སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འབྱུང་བར་འགྱུར་ཏེ།
en: Due to the condition of birth there is old age, death, sorrow, lamentation, suffering, unhappiness, and strife.

source: དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པ་འདི་འབྱུང་བར་འགྱུར་རོ། །
en: Thus does this entire great heap of suffering arise.

source: འདི་ལྟ་སྟེ། མ་རིག་པ་འགགས་པས་འདུ་བྱེད་རྣམས་འགག །
en: In this way, due to the cessation of ignorance, formations will cease.

source: འདུ་བྱེད་རྣམས་འགགས་པས་རྣམ་པར་ཤེས་པ་འགག །
en: Due to the cessation of formations, consciousness will cease.

source: སྐྱེ་བ་འགགས་པས། རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འགག་པར་འགྱུར་ཏེ།
en: Due to the cessation of birth , old age, death, sorrow, lamentation, suffering, unhappiness, and strife will cease.

source: དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པ་འདི་འགག་པར་འགྱུར་རོ། །
en: Thus does this entire great heap of suffering cease.

source: དགེ་སློང་དག་དེ་ལྟར་ན་རྒྱུ་བྱུང་ན། སྡུག་བསྔལ་འབྱུང་བར་འགྱུར་ལ། རྒྱུ་འགགས་ན་སྡུག་བསྔལ་འགག་པར་འགྱུར་ཏེ།
en: “In this way, monks, if the cause arises, suffering will arise, and if the cause ceases, suffering too will cease.

source: ལམ་ཆད་པས་འཇུག་པར་མི་འགྱུར་ལ། ཉིང་མཚམས་སྦྱོར་བ་མེད་པས་འགག་པར་འགྱུར་ཏེ།
en: Its course interrupted, it cannot begin, and in the absence of rebirth, it ceases to be.

source: སྡུག་བསྔལ་གྱི་མཐའ་ནི་དེ་ཁོ་ན་ཡིན་ནོ། །
en: This alone is the end of suffering.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ་ལ་ལན་གཉིས་སུ་བཀའ་སྩལ་པ།
en: Then the Blessed One asked King Bimbisāra of Magadha two times,
